app/controllers/books_controller.rb

  def index
    @user = current_user
    @book = Book.new
    @books = Book.all
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
       flash[:notice] = "You have created book successfully."
       redirect_to book_path(@book.id)
    else
      @user = current_user
      @books = Book.all
---
INSERT INTO "books" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "a"], ["body", "a"], ["created_at", "2021-10-03 10:50:20.829705"], ["updated_at", "2021-10-03 10:50:20.829705"]]
SELECT "books".* FROM "books"